%машина(Марка,Модель,Год,Двигатель,Объем,Мощность,КПП).



машина("Toyota","Supra A70 2.0 G",[1987,1988],
       "1G-EU","2.0","105 л.с.",мкпп).

машина("Toyota","Supra A70 2.0 G",[1989,1990],
       "1G-FE","2.0","135 л.с.",мкпп).

машина("Toyota","Supra A80 3.0 SZ",[1995,1996],
       "2JZ-GE","3.0","225 л.с.",мкпп).

машина("Toyota","Supra A80 3.0 SZ",[1999,2002],
       "2JZ-GE","3.0","225 л.с.",мкпп).

машина("Toyota","Supra DB 2.0 SZ",[2022,-],
       "B48B20","2.0","197 л.с.",акпп).


кпп(Кпп,Модель):-машина(_,Модель,_,_,_,_,Кпп).
двигатель(Двигатель,Модель):-машина(_,Модель,_,Двигатель,_,_,_).
модинфо(Модель,Марка,Год,Двигатель,Объем,Мощность,Кпп):-
    машина(Марка,Модель,Год,Двигатель,Объем,Мощность,Кпп).
